===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
width_bucket(a, '2011-12-12', '2012-12-31', 3)    
null     
1     
3     

===================================================
0
===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
1     
3     

===================================================
Error:-454
===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
null     
null     

===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
1     
3     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
width_bucket(a, '2011-12-12 0:0:0', '2012-12-31 1:2:3', 3)    
null     
1     
3     

===================================================
0
===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
1     
3     

===================================================
Error:-454
===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
null     
null     

===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
1     
3     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
width_bucket(a, '0:0:0', '23:59:59', 3)    
null     
1     
3     

===================================================
0
===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
1     
3     

===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
2     
4     

===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
null     
null     

===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
1     
3     

===================================================
0
===================================================
0
===================================================
0
===================================================
1
===================================================
1
===================================================
1
===================================================
width_bucket(a, '2000', '2020', 10)    
null     
7     
9     

===================================================
0
===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
2     
3     

===================================================
Error:-454
===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
null     
null     

===================================================
width_bucket(a,  ?:0 ,  ?:1 , 3)    
null     
2     
3     

===================================================
0
===================================================
0
