===================================================
0
===================================================
0
===================================================
inet_aton( ?:0 )    
16909060     

===================================================
inet_ntoa( ?:0 )    
1.2.3.4     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
( inet_ntoa( inet_aton( ?:0 )))    
1.2.3.4     

===================================================
( inet_aton( inet_ntoa( ?:0 )))    
16909060     

===================================================
0
===================================================
0
===================================================
0
===================================================
0
===================================================
( inet_ntoa( inet_aton( ?:0 ))= ?:1 )    
1     

===================================================
( inet_aton( inet_ntoa( ?:0 ))= ?:1 )    
1     

===================================================
0
===================================================
0
